# Практическая работа по уроку "Динамическая типизация"

# 1. В проекте, где вы решаете домашние задания, создайте модуль 'module_1_3.py' и напишите весь код в нём.
# 2. Создайте переменные разных типов данных:
#   - Создайте переменную name и присвойте ей значение вашего имени (строка).
#   - Выведите значение переменной name на экран.
#   - Создайте переменную age и присвойте ей значение вашего возраста (целое число).
#   - Выведите значение переменной age на экран.
#   - Перезапишите в age текущее значение переменной age + новое.
#   - Выведите измененное значение переменной age на экран.
#   - Создайте переменную is_student и присвойте ей значение True (логическое значение).
#   - Выведите значение переменной is_student на экран.

name='Tatiana'
print(name)
age=36
print(age)
age=age+5
print(age)
is_student=True
print(is_student)